DEVICE = "cpu"
SAMPLE_RATE = 16000
TOKEN_OFFSET = 100
TIME_STEP = 0.04
NUM_WORKERS = 1


MODEL_RU = "stt_ru_conformer_ctc_large.nemo"
VOCAB_RU = ['<unk>', '▁', 'е', 'с', 'о', 'т', 'а', 'и', 'н', 'м', 'й', 'р', 'у', 'я', 'л', 'д', '▁с', 'ы', '▁в', 'в', 'з', 'к', 'б', 'г', 'но', 'п', '▁на', 'ра', 'ть', 'ка', 'ш', '▁по', 'ни', 'на', 'х', 'то', 'ли', 'ь', 'ро', 'ре', 'ва', '▁и', 'го', '▁б', '▁п', 'ла', 'ко', 'ль', 'ле', 'ст', 'ю', 'ц', '▁о', 'ки', 'ж', 'те', 'ло', 'ве', 'ти', 'во', 'та', 'де', 'ся', 'ч', '▁д', '▁не', '▁за', 'ма', '▁у', 'че', 'ри', 'ф', 'да', 'ви', 'ди', 'ны', '▁к', 'ча', 'ру', '▁а', 'э', '▁ко', 'ми', '▁как', 'щ', 'же', '▁про', '▁мо', '▁включи', 'лю', '▁от', '▁до', 'ку', 'жи', 'ну', '▁мне', '▁что', 'чи', 'ста', '▁фильм', '▁де', 'мен', '▁сезон', '▁при', '▁это', '▁тебя', '▁тв', '▁смотрешке', '▁есть', '▁три', '▁пять', '▁сбер', '▁афина', '▁джой', '▁один', '▁салют', '▁сериал', '▁четыре', '▁семь', '▁шесть', '▁восемь', '▁покажи', '▁канал', '▁хочу', '▁двадцать', '▁серия', '▁можешь', 'ъ']


MODEL_EN = "stt_en_conformer_ctc_large.nemo"
VOCAB_EN = ['<unk>', '▁', 's', 't', 'e', 'd', 'o', '▁the', 'a', 'i', '▁a', 'u', 'y', 'm', 'l', 'n', 'p', 're', 'c', 'h', 'r', '▁s', 'g', '▁to', 'er', 'ing', 'f', '▁and', 'an', '▁i', 'k', '▁that', "'", '▁of', '▁in', 'w', '▁p', 'ed', 'or', 'al', 'ar', '▁f', 'en', 'in', 'b', '▁you', '▁w', '▁b', 'le', 'll', 'es', '▁it', 've', 'ur', '▁we', '▁re', '▁be', 'ly', '▁is', '▁he', '▁o', '▁c', 'it', '▁n', '▁on', 'un', '▁t', 'on', 'se', 'th', 'ce', '▁do', 'ic', '▁for', '▁th', 'ion', 'ch', '▁was', 'ri', 'ent', '▁g', 'ver', '▁co', 'li', '▁ha', '▁ma', 'la', 'ro', 'v', 'us', '▁ca', '▁di', '▁this', 'ra', '▁st', '▁e', '▁not', '▁so', '▁de', '▁have', 'ter', 'ir', '▁go', 'ation', '▁with', 'ate', '▁me', '▁mo', 'ment', '▁con', '▁but', 'vi', '▁pro', '▁ho', 'j', '▁com', 'ight', '▁know', '▁what', 'ect', '▁ex', '▁some', '▁would', '▁like', 'x', '▁his', 'q', 'z']


MODEL_LANG = "ambernet.nemo"

MODEL_PUNCT = "v2_4lang_q.pt"
